[
  {
    "newsId": 1,
    "newsHeading": "Path of Exile 2: The long road to exceeding a decade of expectations",
    "newsImage": "https://cdn2.unrealengine.com/path-of-exile-2-cover-1920x1080-87b1b9c39221.jpg",
    "newsMainContent": "Path of Exile has become a mammoth game since its initial release in October 2013. The free-to-play action role-playing game (or ARPG) now contains about 30 expansions, each introducing a plethora of tweaks and new mechanics, some of which could keep players busy for months or even years. The vast majority of these features are present in Path of Exile to this day, layer upon layer of content to discover and get lost in.",
    "newsparagraph": [
      "Now, developer Grinding Gear Games is betting on a sequel that will coexist with the original.thath of Exile 2 sounds familiar enough—after all, it's still a free-to-play ARPG—but it's an ambitious project nevertheless. Path of Exile 2 will feature a brand new campaign across six Acts, with about 100 environments, 100 bosses, and 600 enemies. There are 12 character classes planned, each with three additional Ascendancy subclasses to specialize into. And there will be 700 equipment base types, each with unique items to find, including new weapons like crossbows, flails, and spears.",
      "Path of Exile has become a mammoth game since its initial release in October 2013. The free-to-play action role-playing game (or ARPG) now contains about 30 expansions, each introducing a plethora of tweaks and new mechanics, some of which could keep players busy for months or even years. The vast majority of these features are present in Path of Exile to this day, layer upon layer of content to discover and get lost in.",
      "Now, developer Grinding Gear Games is betting on a sequel that will coexist with the original. Path of Exile 2 sounds familiar enough—after all, it's still a free-to-play ARPG—but it's an ambitious project nevertheless. Path of Exile 2 will feature a brand new campaign across six Acts, with about 100 environments, 100 bosses, and 600 enemies. There are 12 character classes planned, each with three additional Ascendancy subclasses to specialize into. And there will be 700 equipment base types, each with unique items to find, including new weapons like crossbows, flails, and spears."
    ],
    "newsOfDate": "11.11.2024",
    "newscontributor": "Diego Nicolás Argüello"
  },
  {
    "newsId": 2,
    "newsHeading": "There’s never been a better time to Slay the Princess",
    "newsImage": "https://cdn2.unrealengine.com/there-s-never-been-a-better-time-to-slay-the-princess-ending-1920x1080-0f374ea413b4.jpg",
    "newsMainContent": "Slay the Princess is, on some level, a black-and-white visual novel about deciding the fate of a potentially evil princess. On another level, it’s a five-dimensional adventure of seemingly impossible complexity that tells a mind-bending and utterly compelling story—and with The Pristine Cut, it’s become even better.",
    "newsparagraph": [
      "You’re here to slay the princess. Don’t believe her lies.” Such is the context with which you first approach a cabin in the woods, which features a basement that contains a princess chained to its walls. Who is she? Who are you? And who is the Narrator, a voice that accompanies you, imploring you to not speak to this stranger, not ask any questions, and just plunge a knife into her heart? With vast numbers of ways to respond to every scenario, and the internal conflict as a player of wanting to do what’s right, but also what’s interesting, what unfolds is an interwoven tangle of dozens of possible pathways creating a version of the game entirely unique to you.",
      "That’s the game. Some woods, a cabin, a knife, a basement, and a princess, described by a narrator. What follows is hours of experiencing these elements in dramatically different ways based on the many choices available to you. Perhaps you refuse to take the knife. Perhaps you try to befriend the princess. Maybe you refuse to enter the cabin at all?",
      "The initial scenario for the game,” says co-developer and Lead Writer Tony Howard-Arias, “with ‘woods, cabin, knife, princess, narrator,’ is so simple that you can follow any permutation of actions to their logical end. So, that was an interesting thing to do, right?",
      "Despite this modesty, when you play Slay the Princess, what’s being achieved feels just overwhelming. While trying to avoid any serious spoilers, this is a game where you will encounter that setup of woods/cabin/knife/princess over and over again, and how you respond to it each time causes absolutely wild changes in the narrative, sending you down such different paths that you begin to suspect it has to be faking it, that this route is so complex, so integral, that it was surely forced, your sense of choice an illusion. Then you test it, reload a save, make a slightly different decision among the six you were presented with, and find yourself experiencing something completely different."
    ],
    "newsOfDate": "11.12.2024",
    "newscontributor": "John Walker"
  },
  {
    "newsId": 3,
    "newsHeading": "Planet Coaster 2 guide to help you run your dream park",
    "newsImage": "https://cdn2.unrealengine.com/planet-coaster-2-guide-to-help-you-run-your-dream-park-2560x1440-96233947305f.jpg",
    "newsMainContent": "Planet Coaster 2 is the sequel sandbox management sim from developers Frontier Developments. In it, you take control of a theme park, managing the customer experience by training staff, creating rides, managing schedules, and setting prices. Our Planet Coaster 2 guide contains helpful tips and tricks to keep your park running smoothly as you grow your amusement empire from scrappy funfare to full-blown adrenaline wonderland.",
    "newsparagraph": [
      "If you are entirely new to the series or business management simulators, the game includes a comprehensive prologue that covers the basics of building your park. A difficulty menu also allows you to tweak aspects like Land Cost to make the opening hours of your adventure a little easier.",
      "Create small, efficient activity hubs Rome wasn’t built in a day, and nor is the theme park of your dreams. The open space provided by a fresh save file can feel like a blank canvas, with plenty of room to add convoluted and expensive attractions. While eye-popping rides will certainly attract visitors, longevity, and success come down to building your empire one ambitious project at a time. With this in mind, creating compact areas for parkgoers to explore and filling them with affordable flat rides like the Teacups will generate steady income without too much overhead.",
      "Among the rides, you also need to place amenities like food and drink stalls and ATMs, and the most efficient way to do this is by creating central hubs between sections of rides. Not only does this mean your patrons won’t have to travel too far to get what they need, but you won’t need to pay extra staff to man the shops. Keeping this hub idea consistent as your park grows means you’ll have good coverage across the map without overspending on building costs and workforce. Think of the structure of Disneyland, which peppers in little hubs for restaurants, toilets, and cash machines for convenience among the rides.",
      "Once you have those basics down, you can start dressing up your park with an exciting roller coaster or purchasing useful add-ons like pool sunbeds. Both of these actions add to a Prestige metric that attracts more guests. You can view each ride's prestige by selecting it with your cursor and scrolling down to the Important Stats section."
    ],
    "newsOfDate": "11.12.2024",
    "newscontributor": "Sarah Thwaites"
  },
  {
    "newsId": 4,
    "newsHeading": "Teenage Mutant Ninja Turtles: Splintered Fate guide—how to make the most out of every run",
    "newsImage": "https://cdn2.unrealengine.com/teenage-mutant-ninja-turtles-splintered-fate-guide-how-to-make-the-most-out-of-every-run-3840x2160-4a1dcfcf852c.png",
    "newsMainContent": "After laying dormant for far too long, everyone’s favorite anthropomorphic turtles have been making a resurgence as of late. Having made a splash back in 2022 with the retro-inspired Shredder’s Revenge, the team is making their mark once again with the release of Teenage Mutant Ninja Turtles: Splintered Fate, swapping out the old-school beat-'em-up for a roguelike brawler that takes a few cues from Epic Games Store’s first breakout hit Hades.",
    "newsparagraph": [
      "To help you hit the ground running, we’ve compiled a list of tips and tricks to help you make the most out of each of your runs and rescue Splinter from the clutches of the Foot Clan. Whether you’re a fan of roguelikes in general or a longtime Turtles junkie, there’s plenty to dig into and experiment with in developer Super Evil Megacorp’s latest game.",
      "Don’t fear death… embrace it! This likely isn’t news for anyone who’s logged plenty of time with other roguelikes, but for those who are new to the genre, here’s a bit of a rundown on what you can expect. Unlike other Teenage Mutant Ninja Turtles games, Splintered Fate is built around the idea of runs. Instead of playing through levels with predetermined layouts, encounters, and bosses, each new gameplay session will be randomized, which means you’ll find different powerups and enemies each time you kick off a new run.",
      "If this sounds a bit daunting, that’s because it can be. But don’t fret—while having to adapt to constantly changing level layouts might seem like an impossible task, TMNT: Splintered Fate follows the same path as many of its contemporaries, giving you a few tools at your disposal to help you get a little bit further on each run, as opposed to being stuck in an endless cycle of death."
    ],
    "newsOfDate": "24.12.2024",
    "newscontributor": "Shaan Josh"
  },
  {
    "newsId": 5,
    "newsHeading": "Prepare to plow with our Farming Simulator 25 beginner’s guide",
    "newsImage": "https://cdn2.unrealengine.com/farming-simulator-25-cows-1920x1080-23a6b0c8ff56.jpg",
    "newsMainContent": "At first blush, Farming Simulator 25 can feel a bit intimidating. Like many simulators, it places you in an immaculately crafted, clockwork-like world and grants you the freedom to build your empire however you choose. However, when you're standing at the store, wondering exactly how to transport the thousands of dollars’ worth of fertilizer you just bought back to your farm, you might need a little help. That's where we come in.",
    "newsparagraph": [
      "Listen to granddad When you meet your grandfather in the game's opening minutes, he offers to show you the ropes. If you're new toFarming Simulator 25, we highly recommend listening. He teaches you the basics of cultivation, planting, and harvesting.  Farming Simulator 25offers several customizable difficulty sliders to adjust before you begin, including the amount of money you start with, the loan you owe (if any), and whether or not you start with actual farmland and equipment. If you're a newbie, we strongly recommend setting Start Farm and Guided Intro-Tour to “Yes”, as you'll need both of those to trigger your grandfather's tutorial. Otherwise, you'll be left to fend for yourself.",
      "Start with contracts Regardless of whether or not you opt to start with some farmland, you're going to want to start your farming journey by taking on a few contracts. You can find these in the pause menu, and they allow you to perform a task for a small fee. Naturally, some of these contracts are more lucrative and time-consuming than others, and most require you to learn a new piece of equipment (or three) to get the job done. It's important to note that you can rent the equipment you need to fulfill a contract by pressing Backspace (or clicking the appropriate icon) when accepting it. The equipment will spawn at the store near the gas station in town. In general, we recommend starting with simple tasks like clearing away deadwood."
    ],
    "newsOfDate": "11.12.2024",
    "newscontributor": "Steven T. Wright"
  }
]
